; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-5nodes-1000size-5degree-100mindistance-2trucks-4packages-445seed

(define (problem transport-city-sequential-5nodes-1000size-5degree-100mindistance-2trucks-4packages-445seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 255,81 -> 564,433
  (road city-loc-2 city-loc-1)
  (= (road-length city-loc-2 city-loc-1) 47)
  ; 564,433 -> 255,81
  (road city-loc-1 city-loc-2)
  (= (road-length city-loc-1 city-loc-2) 47)
  ; 402,693 -> 564,433
  (road city-loc-3 city-loc-1)
  (= (road-length city-loc-3 city-loc-1) 31)
  ; 564,433 -> 402,693
  (road city-loc-1 city-loc-3)
  (= (road-length city-loc-1 city-loc-3) 31)
  ; 402,693 -> 255,81
  (road city-loc-3 city-loc-2)
  (= (road-length city-loc-3 city-loc-2) 63)
  ; 255,81 -> 402,693
  (road city-loc-2 city-loc-3)
  (= (road-length city-loc-2 city-loc-3) 63)
  ; 992,928 -> 564,433
  (road city-loc-4 city-loc-1)
  (= (road-length city-loc-4 city-loc-1) 66)
  ; 564,433 -> 992,928
  (road city-loc-1 city-loc-4)
  (= (road-length city-loc-1 city-loc-4) 66)
  ; 992,928 -> 402,693
  (road city-loc-4 city-loc-3)
  (= (road-length city-loc-4 city-loc-3) 64)
  ; 402,693 -> 992,928
  (road city-loc-3 city-loc-4)
  (= (road-length city-loc-3 city-loc-4) 64)
  ; 911,263 -> 564,433
  (road city-loc-5 city-loc-1)
  (= (road-length city-loc-5 city-loc-1) 39)
  ; 564,433 -> 911,263
  (road city-loc-1 city-loc-5)
  (= (road-length city-loc-1 city-loc-5) 39)
  ; 911,263 -> 402,693
  (road city-loc-5 city-loc-3)
  (= (road-length city-loc-5 city-loc-3) 67)
  ; 402,693 -> 911,263
  (road city-loc-3 city-loc-5)
  (= (road-length city-loc-3 city-loc-5) 67)
  ; 911,263 -> 992,928
  (road city-loc-5 city-loc-4)
  (= (road-length city-loc-5 city-loc-4) 67)
  ; 992,928 -> 911,263
  (road city-loc-4 city-loc-5)
  (= (road-length city-loc-4 city-loc-5) 67)
  (at package-1 city-loc-4)
  (at package-2 city-loc-5)
  (at package-3 city-loc-3)
  (at package-4 city-loc-2)
  (at truck-1 city-loc-4)
  (capacity truck-1 capacity-3)
  (at truck-2 city-loc-3)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-loc-3)
  (at package-2 city-loc-4)
  (at package-3 city-loc-2)
  (at package-4 city-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-1 city-loc-4 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-loc-4) (capacity truck-1 capacity-3)
   added: (in package-1 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 4
2. (drive truck-1 city-loc-4 city-loc-3)
   deleted: (at truck-1 city-loc-4)
   added: (at truck-1 city-loc-3)
   goals met: 0 of 4
3. (pick-up truck-1 city-loc-3 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-loc-3) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 4
4. (drop truck-1 city-loc-3 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-1)
   added: (at package-1 city-loc-3) (capacity truck-1 capacity-2)
   goals met: 1 of 4
5. (drive truck-1 city-loc-3 city-loc-2)
   deleted: (at truck-1 city-loc-3)
   added: (at truck-1 city-loc-2)
   goals met: 1 of 4
6. (pick-up truck-1 city-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-loc-2) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 1 of 4
7. (drop truck-1 city-loc-2 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-1)
   added: (at package-3 city-loc-2) (capacity truck-1 capacity-2)
   goals met: 2 of 4
8. (drive truck-1 city-loc-2 city-loc-1)
   deleted: (at truck-1 city-loc-2)
   added: (at truck-1 city-loc-1)
   goals met: 2 of 4
9. (drive truck-1 city-loc-1 city-loc-5)
   deleted: (at truck-1 city-loc-1)
   added: (at truck-1 city-loc-5)
   goals met: 2 of 4
10. (drop truck-1 city-loc-5 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-2)
   added: (at package-4 city-loc-5) (capacity truck-1 capacity-3)
   goals met: 3 of 4
11. (pick-up truck-1 city-loc-5 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-loc-5) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 3 of 4
12. (drive truck-1 city-loc-5 city-loc-4)
   deleted: (at truck-1 city-loc-5)
   added: (at truck-1 city-loc-4)
   goals met: 3 of 4
13. (drop truck-1 city-loc-4 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-2)
   added: (at package-2 city-loc-4) (capacity truck-1 capacity-3)
   goals met: 4 of 4
